; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob88) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear pallet7)
	(at pallet8 depot0)
	(clear pallet8)
	(at pallet9 depot0)
	(clear pallet9)
	(at pallet10 depot2)
	(clear pallet10)
	(at pallet11 distributor2)
	(clear pallet11)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 depot1)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 crate0)
	(at crate4 depot2)
	(on crate4 pallet2)
)

(:goal (and
		(on crate1 pallet8)
		(on crate2 pallet7)
		(on crate3 pallet2)
		(on crate4 pallet10)
	)
))

; plan
1. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 0 of 4
2. (lift hoist2 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 0 of 4
3. (drop hoist2 crate4 pallet10 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet10)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 pallet10)
   goals met: 1 of 4
4. (lift hoist1 crate2 crate1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   goals met: 1 of 4
5. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 1 of 4
6. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 1 of 4
7. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 4
8. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 1 of 4
9. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 4
10. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 1 of 4
11. (unload hoist8 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 1 of 4
12. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 1 of 4
13. (drop hoist8 crate2 pallet7 distributor2)
   deleted: (lifting hoist8 crate2) (clear pallet7)
   added: (available hoist8) (at crate2 distributor2) (clear crate2) (on crate2 pallet7)
   goals met: 2 of 4
14. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 2 of 4
15. (drop hoist0 crate1 pallet8 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet8)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet8)
   goals met: 3 of 4
16. (lift hoist0 crate3 crate0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate0)
   added: (lifting hoist0 crate3) (clear crate0)
   goals met: 3 of 4
17. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 3 of 4
18. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 3 of 4
19. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 3 of 4
20. (drop hoist2 crate3 pallet2 depot2)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 pallet2)
   goals met: 4 of 4
